#对列表进行切片

# # # list1 = [10,20,30,40,50,60,70,80,90,100]
# # # list2=list1[0:5:1]
# # # print(list2)
# #
# # # list1 = [10,20,30,40,50,60,70,80,90,100]
# # # list2=list1[1:8:2]
# # # print(list2)
# #
# # list1 = [10,20,30,40,50,60,70,80,90,100]
# # list2=list1[1:8:3]
# # print(list2)
# #
# # list1 = [10,20,30,40,50,60,70,80,90,100]
# # list2=list1[::]
# # list3=list1[0:10:1]
# # print(list2)
#
# # list1 = [10,20,30,40,50,60,70,80,90,100]
# # list2=list1[:999:]
# # print(list2)
#
# list1 = [10,20,30,40,50,60,70,80,90,100]
# list2=list1[3::]
# print(list2)


# list1 = [10,20,30,40,50,60,70,80,90,100]
# list2=list1[:5:]
# print(list2)

# list1 = [10,20,30,40,50,60,70,80,90,100]
# list2=list1[::4]
# print(list2)

#起始索引>结束索引时，步长必须为负数
# list1 = [10,20,30,40,50,60,70,80,90,100]
# list2=list1[7:2:-1]
# print(list2)



#特殊,自动对调
# list1 = [10,20,30,40,50,60,70,80,90,100]
# list2=list1[::-1]
# print(list2)

#对元组切片
# tuple1=(10,20,30,40,50,60,70,80,90,100)
# tuple2=tuple1[0:5:1]
# print(tuple2)

msg1='hello world'
msg2=msg1[0:5:1]
print(msg2)